<?php

/**
    有一定的 PHP + MySQL 基础 
    要有独立服务器或者空间

    对微信开发感兴趣
    工作需要
    业余赚钱

    基础篇 ---> 微信公众账号的分类 数据交互原理 API 接入
           微信公众账号介绍和申请流程
           微信公众账号的工作原理和接口介绍
           在应用中接入微信公众账号 API
    提升篇 ---> 常用普通接口 消息发送和接收 事件推送等
    高级篇 ---> 常用高级接口 网页授权 模板消息等
    实战篇 ---> 通过一个实战项目贯穿所学知识点

    微信公众平台开发 --- 基础篇
    微信公众账号和申请流程
    微信公众账号的工作原理和接口介绍
    在应用中接入微信公众账号 API

    微信公众账号 --- 自媒体
    微信应用 --- APP (平台角色)
    微信用户 --- 普通用户

    微信公众账号类型和区别
    服务号 订阅号 企业号
    订阅号 适用于个人和组织
    服务号 不适用于个人
    企业号 帮助企业和组织

    公众账号认证

    申请微信公众账号
    https://mp.weixin.qq.com
    使用caopeng8787 邮箱注册
    邮箱激活
    选择订阅号 ---> 个人 ---> 进入微信扫描 

    公众账号的使用模式分类
    编辑模式
    开发者模式

    进入公众账号
    注意 (进入编辑模式时 需要停用开发者模式 开发 --- 基本配置 --- 停用)
    关注公众号 (公众号设置 --- 二维码)
    http://mp.weixin.qq.com/wiki/home/index.html 公众平台开发者文档
*/