<?php

/**
    钱的属性

    分类 
    债权 自己 亲朋好友借的钱
    股权 VC 的钱

    VC 的钱从哪来 
    LP ---> 存续期 ---> 退出 (上市 并购)

    VC 的投资决策
    Deal Sourcing ---> 投委会

    VC 投什么样的项目
    平均回倍 3-5 倍 个案预期回报 30 - 50 倍

    VC 选项目
    目标 高增长 垄断 壁垒
    市场 在市场 顺势
    趋势 变化
    杠杆 需求杠杆 供给杠杆

    轮次
    天使 找到滩头阵地

    A 轮
    形成小垄断

    增长轮 (B C轮) 复制得到更多的市场

    PE 轮
    大垄断 -> 跃进

    VC 的价值
    钱 (当前的钱 未来的钱)

    其他价值
    市场趋势 人脉资源 上下游资源

    融资准备

    项目总结
    产品/服务价值 团队能力 (与项目匹配)

    融资金额
    融资额 (达成下一阶段目标)
    估值 (关注市场)

    BP
    只是工具 简单
    内容 市场规模 用户 产品/服务 竞争对手 团队 融资额

    融资过程
    投资人名单
    知已知彼
    知名单 --- 分梯队

    融资过程
    迭代进行 --- 从投资人那里获得反馈

    时间周期
    时间周期控制 --- 不超过一个月

    融资选择
    选择
    基金优势 --- 选你想要的
    董事人选 --- 重点考察

    拿到 TS 不等于融资结束
    DD 协议 文书
*/