<?php

/**
    职业规划
    什么是职业规划
    职业规划的方法和工具
    Q&A

    职业规划 对职业生涯至人生的系统而持续的规划

    职业经历是日积月累的 很少出现大的跳动
    犯下的错误和花去的时间不能重来

    一个完整的职业规划包括三个部分
    职业定位 目标设定 通道设计

    雇员 管理线的沟通能力 (与程序员的沟通 与产品的沟通)
    开发 ---> 高级开发 ---> 小组经理 ---> 部门经理 ---> 总 ---> 上市公司 CTO
         ---> 深度专家 ---> 架构师   ---> 行业大牛

    程序员思维 (精确性 考虑小概率事件 二元论,非对即错 关注开发成本 可控性&安全感)
    非程序员思维 (简单易懂 扫描式阅读 接受模糊结果 关注学习成本 有用&有趣)

    专家线的架构能力
    提升架构能力的两个基本原则
    Don't Repeat Yourself
    正交性设计

    小老板线
    改行 (建站或外包公司 工作室) ---> CEO

    创业线
    创业公司核心 创业公司 CTO 创业公司 CEO

    创业和创造的不同
    CTO 低风险创业通道
*/